# running in lockstep_consensus_lockstep_consensus/src/
read_verilog -sv ../../rtl/core/tcls_voter.v
prep -top tcls_voter

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
